ataradov/mcu-starter-projects/samg53/include/component/spi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RCR_OFFSET                      (0x104)                                       /**<  (SPI_RCR) Receive Counter Register  Offset */

#define SPI_RCR_RXCTR_Pos                   0                                              /**< (SPI_RCR) Receive Counter Register Position */
#define SPI_RCR_RXCTR_Msk                   (_U_(0xFFFF) << SPI_RCR_RXCTR_Pos)             /**< (SPI_RCR) Receive Counter Register Mask */
#define SPI_RCR_RXCTR(value)                (SPI_RCR_RXCTR_Msk & ((value) << SPI_RCR_RXCTR_Pos))
#define SPI_RCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (SPI_RCR) Register MASK  (Use SPI_RCR_Msk instead)  */
#define SPI_RCR_Msk                         _U_(0xFFFF)                                    /**< (SPI_RCR) Register Mask  */


/* -------- SPI_TPR : (SPI Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TPR_OFFSET                      (0x108)                                       /**<  (SPI_TPR) Transmit Pointer Register  Offset */

#define SPI_TPR_TXPTR_Pos                   0                                              /**< (SPI_TPR) Transmit Counter Register Position */
#define SPI_TPR_TXPTR_Msk                   (_U_(0xFFFFFFFF) << SPI_TPR_TXPTR_Pos)         /**< (SPI_TPR) Transmit Counter Register Mask */
#define SPI_TPR_TXPTR(value)                (SPI_TPR_TXPTR_Msk & ((value) << SPI_TPR_TXPTR_Pos))
#define SPI_TPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (SPI_TPR) Register MASK  (Use SPI_TPR_Msk instead)  */
#define SPI_TPR_Msk                         _U_(0xFFFFFFFF)                                /**< (SPI_TPR) Register Mask  */


/* -------- SPI_TCR : (SPI Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_TCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TCR_OFFSET                      (0x10C)                                       /**<  (SPI_TCR) Transmit Counter Register  Offset */

#define SPI_TCR_TXCTR_Pos                   0                                              /**< (SPI_TCR) Transmit Counter Register Position */
#define SPI_TCR_TXCTR_Msk                   (_U_(0xFFFF) << SPI_TCR_TXCTR_Pos)             /**< (SPI_TCR) Transmit Counter Register Mask */
#define SPI_TCR_TXCTR(value)                (SPI_TCR_TXCTR_Msk & ((value) << SPI_TCR_TXCTR_Pos))
#define SPI_TCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (SPI_TCR) Register MASK  (Use SPI_TCR_Msk instead)  */
#define SPI_TCR_Msk                         _U_(0xFFFF)                                    /**< (SPI_TCR) Register Mask  */


/* -------- SPI_RNPR : (SPI Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RNPR_OFFSET                     (0x110)                                       /**<  (SPI_RNPR) Receive Next Pointer Register  Offset */

#define SPI_RNPR_RXNPTR_Pos                 0                                              /**< (SPI_RNPR) Receive Next Pointer Position */
#define SPI_RNPR_RXNPTR_Msk                 (_U_(0xFFFFFFFF) << SPI_RNPR_RXNPTR_Pos)       /**< (SPI_RNPR) Receive Next Pointer Mask */
#define SPI_RNPR_RXNPTR(value)              (SPI_RNPR_RXNPTR_Msk & ((value) << SPI_RNPR_RXNPTR_Pos))
#define SPI_RNPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (SPI_RNPR) Register MASK  (Use SPI_RNPR_Msk instead)  */
#define SPI_RNPR_Msk                        _U_(0xFFFFFFFF)                                /**< (SPI_RNPR) Register Mask  */


/* -------- SPI_RNCR : (SPI Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RNCR_OFFSET                     (0x114)                                       /**<  (SPI_RNCR) Receive Next Counter Register  Offset */

#define SPI_RNCR_RXNCTR_Pos                 0                                              /**< (SPI_RNCR) Receive Next Counter Position */
#define SPI_RNCR_RXNCTR_Msk                 (_U_(0xFFFF) << SPI_RNCR_RXNCTR_Pos)           /**< (SPI_RNCR) Receive Next Counter Mask */
#define SPI_RNCR_RXNCTR(value)              (SPI_RNCR_RXNCTR_Msk & ((value) << SPI_RNCR_RXNCTR_Pos))
#define SPI_RNCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (SPI_RNCR) Register MASK  (Use SPI_RNCR_Msk instead)  */
#define SPI_RNCR_Msk                        _U_(0xFFFF)                                    /**< (SPI_RNCR) Register Mask  */


/* -------- SPI_TNPR : (SPI Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_TNPR_Type;
