ataradov/mcu-starter-projects/samg53/include/component/spi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TNPR_OFFSET                     (0x118)                                       /**<  (SPI_TNPR) Transmit Next Pointer Register  Offset */

#define SPI_TNPR_TXNPTR_Pos                 0                                              /**< (SPI_TNPR) Transmit Next Pointer Position */
#define SPI_TNPR_TXNPTR_Msk                 (_U_(0xFFFFFFFF) << SPI_TNPR_TXNPTR_Pos)       /**< (SPI_TNPR) Transmit Next Pointer Mask */
#define SPI_TNPR_TXNPTR(value)              (SPI_TNPR_TXNPTR_Msk & ((value) << SPI_TNPR_TXNPTR_Pos))
#define SPI_TNPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (SPI_TNPR) Register MASK  (Use SPI_TNPR_Msk instead)  */
#define SPI_TNPR_Msk                        _U_(0xFFFFFFFF)                                /**< (SPI_TNPR) Register Mask  */


/* -------- SPI_TNCR : (SPI Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_TNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TNCR_OFFSET                     (0x11C)                                       /**<  (SPI_TNCR) Transmit Next Counter Register  Offset */

#define SPI_TNCR_TXNCTR_Pos                 0                                              /**< (SPI_TNCR) Transmit Counter Next Position */
#define SPI_TNCR_TXNCTR_Msk                 (_U_(0xFFFF) << SPI_TNCR_TXNCTR_Pos)           /**< (SPI_TNCR) Transmit Counter Next Mask */
#define SPI_TNCR_TXNCTR(value)              (SPI_TNCR_TXNCTR_Msk & ((value) << SPI_TNCR_TXNCTR_Pos))
#define SPI_TNCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (SPI_TNCR) Register MASK  (Use SPI_TNCR_Msk instead)  */
#define SPI_TNCR_Msk                        _U_(0xFFFF)                                    /**< (SPI_TNCR) Register Mask  */


/* -------- SPI_PTCR : (SPI Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_PTCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_PTCR_OFFSET                     (0x120)                                       /**<  (SPI_PTCR) Transfer Control Register  Offset */

#define SPI_PTCR_RXTEN_Pos                  0                                              /**< (SPI_PTCR) Receiver Transfer Enable Position */
#define SPI_PTCR_RXTEN_Msk                  (_U_(0x1) << SPI_PTCR_RXTEN_Pos)               /**< (SPI_PTCR) Receiver Transfer Enable Mask */
#define SPI_PTCR_RXTEN                      SPI_PTCR_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_RXTEN_Msk instead */
#define SPI_PTCR_RXTDIS_Pos                 1                                              /**< (SPI_PTCR) Receiver Transfer Disable Position */
#define SPI_PTCR_RXTDIS_Msk                 (_U_(0x1) << SPI_PTCR_RXTDIS_Pos)              /**< (SPI_PTCR) Receiver Transfer Disable Mask */
#define SPI_PTCR_RXTDIS                     SPI_PTCR_RXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_RXTDIS_Msk instead */
#define SPI_PTCR_TXTEN_Pos                  8                                              /**< (SPI_PTCR) Transmitter Transfer Enable Position */
#define SPI_PTCR_TXTEN_Msk                  (_U_(0x1) << SPI_PTCR_TXTEN_Pos)               /**< (SPI_PTCR) Transmitter Transfer Enable Mask */
#define SPI_PTCR_TXTEN                      SPI_PTCR_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_TXTEN_Msk instead */
#define SPI_PTCR_TXTDIS_Pos                 9                                              /**< (SPI_PTCR) Transmitter Transfer Disable Position */
#define SPI_PTCR_TXTDIS_Msk                 (_U_(0x1) << SPI_PTCR_TXTDIS_Pos)              /**< (SPI_PTCR) Transmitter Transfer Disable Mask */
#define SPI_PTCR_TXTDIS                     SPI_PTCR_TXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_TXTDIS_Msk instead */
#define SPI_PTCR_RXCBEN_Pos                 16                                             /**< (SPI_PTCR) Receiver Circular Buffer Enable Position */
#define SPI_PTCR_RXCBEN_Msk                 (_U_(0x1) << SPI_PTCR_RXCBEN_Pos)              /**< (SPI_PTCR) Receiver Circular Buffer Enable Mask */
#define SPI_PTCR_RXCBEN                     SPI_PTCR_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_RXCBEN_Msk instead */
#define SPI_PTCR_RXCBDIS_Pos                17                                             /**< (SPI_PTCR) Receiver Circular Buffer Disable Position */
#define SPI_PTCR_RXCBDIS_Msk                (_U_(0x1) << SPI_PTCR_RXCBDIS_Pos)             /**< (SPI_PTCR) Receiver Circular Buffer Disable Mask */
#define SPI_PTCR_RXCBDIS                    SPI_PTCR_RXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_RXCBDIS_Msk instead */
#define SPI_PTCR_TXCBEN_Pos                 18                                             /**< (SPI_PTCR) Transmitter Circular Buffer Enable Position */
#define SPI_PTCR_TXCBEN_Msk                 (_U_(0x1) << SPI_PTCR_TXCBEN_Pos)              /**< (SPI_PTCR) Transmitter Circular Buffer Enable Mask */
#define SPI_PTCR_TXCBEN                     SPI_PTCR_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_TXCBEN_Msk instead */
#define SPI_PTCR_TXCBDIS_Pos                19                                             /**< (SPI_PTCR) Transmitter Circular Buffer Disable Position */
#define SPI_PTCR_TXCBDIS_Msk                (_U_(0x1) << SPI_PTCR_TXCBDIS_Pos)             /**< (SPI_PTCR) Transmitter Circular Buffer Disable Mask */
#define SPI_PTCR_TXCBDIS                    SPI_PTCR_TXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_TXCBDIS_Msk instead */
#define SPI_PTCR_ERRCLR_Pos                 24                                             /**< (SPI_PTCR) Transfer Bus Error Clear Position */
#define SPI_PTCR_ERRCLR_Msk                 (_U_(0x1) << SPI_PTCR_ERRCLR_Pos)              /**< (SPI_PTCR) Transfer Bus Error Clear Mask */
#define SPI_PTCR_ERRCLR                     SPI_PTCR_ERRCLR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTCR_ERRCLR_Msk instead */
#define SPI_PTCR_MASK                       _U_(0x10F0303)                                 /**< \deprecated (SPI_PTCR) Register MASK  (Use SPI_PTCR_Msk instead)  */
#define SPI_PTCR_Msk                        _U_(0x10F0303)                                 /**< (SPI_PTCR) Register Mask  */


