ataradov/mcu-starter-projects/samg53/include/component/spi.h
/* -------- SPI_PTSR : (SPI Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_PTSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_PTSR_OFFSET                     (0x124)                                       /**<  (SPI_PTSR) Transfer Status Register  Offset */

#define SPI_PTSR_RXTEN_Pos                  0                                              /**< (SPI_PTSR) Receiver Transfer Enable Position */
#define SPI_PTSR_RXTEN_Msk                  (_U_(0x1) << SPI_PTSR_RXTEN_Pos)               /**< (SPI_PTSR) Receiver Transfer Enable Mask */
#define SPI_PTSR_RXTEN                      SPI_PTSR_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTSR_RXTEN_Msk instead */
#define SPI_PTSR_TXTEN_Pos                  8                                              /**< (SPI_PTSR) Transmitter Transfer Enable Position */
#define SPI_PTSR_TXTEN_Msk                  (_U_(0x1) << SPI_PTSR_TXTEN_Pos)               /**< (SPI_PTSR) Transmitter Transfer Enable Mask */
#define SPI_PTSR_TXTEN                      SPI_PTSR_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTSR_TXTEN_Msk instead */
#define SPI_PTSR_RXCBEN_Pos                 16                                             /**< (SPI_PTSR) Receiver Circular Buffer Enable Position */
#define SPI_PTSR_RXCBEN_Msk                 (_U_(0x1) << SPI_PTSR_RXCBEN_Pos)              /**< (SPI_PTSR) Receiver Circular Buffer Enable Mask */
#define SPI_PTSR_RXCBEN                     SPI_PTSR_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTSR_RXCBEN_Msk instead */
#define SPI_PTSR_TXCBEN_Pos                 18                                             /**< (SPI_PTSR) Transmitter Circular Buffer Enable Position */
#define SPI_PTSR_TXCBEN_Msk                 (_U_(0x1) << SPI_PTSR_TXCBEN_Pos)              /**< (SPI_PTSR) Transmitter Circular Buffer Enable Mask */
#define SPI_PTSR_TXCBEN                     SPI_PTSR_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTSR_TXCBEN_Msk instead */
#define SPI_PTSR_ERR_Pos                    24                                             /**< (SPI_PTSR) Transfer Bus Error Position */
#define SPI_PTSR_ERR_Msk                    (_U_(0x1) << SPI_PTSR_ERR_Pos)                 /**< (SPI_PTSR) Transfer Bus Error Mask */
#define SPI_PTSR_ERR                        SPI_PTSR_ERR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_PTSR_ERR_Msk instead */
#define SPI_PTSR_MASK                       _U_(0x1050101)                                 /**< \deprecated (SPI_PTSR) Register MASK  (Use SPI_PTSR_Msk instead)  */
#define SPI_PTSR_Msk                        _U_(0x1050101)                                 /**< (SPI_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief SPI hardware registers */
typedef struct {  
  __O  uint32_t SPI_CR;         /**< (SPI Offset: 0x00) Control Register */
  __IO uint32_t SPI_MR;         /**< (SPI Offset: 0x04) Mode Register */
  __I  uint32_t SPI_RDR;        /**< (SPI Offset: 0x08) Receive Data Register */
  __O  uint32_t SPI_TDR;        /**< (SPI Offset: 0x0C) Transmit Data Register */
  __I  uint32_t SPI_SR;         /**< (SPI Offset: 0x10) Status Register */
  __O  uint32_t SPI_IER;        /**< (SPI Offset: 0x14) Interrupt Enable Register */
  __O  uint32_t SPI_IDR;        /**< (SPI Offset: 0x18) Interrupt Disable Register */
  __I  uint32_t SPI_IMR;        /**< (SPI Offset: 0x1C) Interrupt Mask Register */
  RoReg8  Reserved1[0x10];
  __IO uint32_t SPI_CSR[2];     /**< (SPI Offset: 0x30) Chip Select Register 0 */
  RoReg8  Reserved2[0xAC];
  __IO uint32_t SPI_WPMR;       /**< (SPI Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t SPI_WPSR;       /**< (SPI Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved3[0x14];
  __IO uint32_t SPI_RPR;        /**< (SPI Offset: 0x100) Receive Pointer Register */
  __IO uint32_t SPI_RCR;        /**< (SPI Offset: 0x104) Receive Counter Register */
  __IO uint32_t SPI_TPR;        /**< (SPI Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t SPI_TCR;        /**< (SPI Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t SPI_RNPR;       /**< (SPI Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t SPI_RNCR;       /**< (SPI Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t SPI_TNPR;       /**< (SPI Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t SPI_TNCR;       /**< (SPI Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t SPI_PTCR;       /**< (SPI Offset: 0x120) Transfer Control Register */
  __I  uint32_t SPI_PTSR;       /**< (SPI Offset: 0x124) Transfer Status Register */
} Spi;

