ataradov/mcu-starter-projects/samg53/include/component/spi.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief SPI hardware registers */
typedef struct {  
  __O  SPI_CR_Type                    SPI_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO SPI_MR_Type                    SPI_MR;         /**< Offset: 0x04 (R/W  32) Mode Register */
  __I  SPI_RDR_Type                   SPI_RDR;        /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O  SPI_TDR_Type                   SPI_TDR;        /**< Offset: 0x0C ( /W  32) Transmit Data Register */
  __I  SPI_SR_Type                    SPI_SR;         /**< Offset: 0x10 (R/   32) Status Register */
  __O  SPI_IER_Type                   SPI_IER;        /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O  SPI_IDR_Type                   SPI_IDR;        /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I  SPI_IMR_Type                   SPI_IMR;        /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I  uint32_t                       Reserved1[4];
  __IO SPI_CSR_Type                   SPI_CSR[2];     /**< Offset: 0x30 (R/W  32) Chip Select Register 0 */
  __I  uint32_t                       Reserved2[43];
  __IO SPI_WPMR_Type                  SPI_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  SPI_WPSR_Type                  SPI_WPSR;       /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved3[5];
  __IO SPI_RPR_Type                   SPI_RPR;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO SPI_RCR_Type                   SPI_RCR;        /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO SPI_TPR_Type                   SPI_TPR;        /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO SPI_TCR_Type                   SPI_TCR;        /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO SPI_RNPR_Type                  SPI_RNPR;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO SPI_RNCR_Type                  SPI_RNCR;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO SPI_TNPR_Type                  SPI_TNPR;       /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO SPI_TNCR_Type                  SPI_TNCR;       /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  SPI_PTCR_Type                  SPI_PTCR;       /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  SPI_PTSR_Type                  SPI_PTSR;       /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Spi;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Serial Peripheral Interface */

#endif /* _SAMG53_SPI_COMPONENT_H_ */
